tests/ecp_soap.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:ns1="urn:liberty:paos:2003-08"
              xmlns:ecp="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
              xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
              xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
    <ns0:Header>
        <ns1:Request responseConsumerURL="https://sp.example.org/PAOSConsumer"
                     service="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
                     ns0:actor="http://schemas.xmlsoap.org/soap/actor/next"
                     ns0:mustUnderstand="1"/>
        <ecp:Request ProviderName="Example Service Provider"
                     ns0:actor="http://schemas.xmlsoap.org/soap/actor/next"
                     ns0:mustUnderstand="1">
            <samlp:IDPList>
                <samlp:IDPEntry Loc="https://idp.example.org/saml2/sso"
                              Name="Example identity provider"
                              ProviderID="https://idp.example.org/entity"/>
            </samlp:IDPList>
            <saml:Issuer>https://sp.example.org/entity</saml:Issuer>
        </ecp:Request>
        <ecp:RelayState ns0:actor="http://schemas.xmlsoap.org/soap/actor/next"
                        ns0:mustUnderstand="1">ABCDEFGHI01234567
        </ecp:RelayState>
    </ns0:Header>
    <ns0:Body>
        <samlp:AuthnRequest/>
    </ns0:Body>
</ns0:Envelope>
